bol0o/traffic-lights-sim/firmware_stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_W_RED_Pin GPIO_PIN_0
#define LED_W_RED_GPIO_Port GPIOC
#define LED_W_YELLOW_Pin GPIO_PIN_1
#define LED_W_YELLOW_GPIO_Port GPIOC
#define LED_W_GREEN_Pin GPIO_PIN_2
#define LED_W_GREEN_GPIO_Port GPIOC
#define LED_W_FIRST_Pin GPIO_PIN_3
#define LED_W_FIRST_GPIO_Port GPIOC
#define LED_S_RED_Pin GPIO_PIN_0
#define LED_S_RED_GPIO_Port GPIOA
#define LED_S_YELLOW_Pin GPIO_PIN_1
#define LED_S_YELLOW_GPIO_Port GPIOA
#define LED_S_SECOND_Pin GPIO_PIN_4
#define LED_S_SECOND_GPIO_Port GPIOA
#define BTN_WEST_Pin GPIO_PIN_5
#define BTN_WEST_GPIO_Port GPIOA
#define LED_W_SECOND_Pin GPIO_PIN_4
#define LED_W_SECOND_GPIO_Port GPIOC
#define LED_S_GREEN_Pin GPIO_PIN_5
#define LED_S_GREEN_GPIO_Port GPIOC
#define LED_N_RED_Pin GPIO_PIN_0
#define LED_N_RED_GPIO_Port GPIOB
#define LED_N_YELLOW_Pin GPIO_PIN_1
#define LED_N_YELLOW_GPIO_Port GPIOB
#define LED_N_GREEN_Pin GPIO_PIN_2
#define LED_N_GREEN_GPIO_Port GPIOB
#define BTN_NORTH_Pin GPIO_PIN_6
#define BTN_NORTH_GPIO_Port GPIOC
#define BTN_SOUTH_Pin GPIO_PIN_9
#define BTN_SOUTH_GPIO_Port GPIOD
#define LED_S_FIRST_Pin GPIO_PIN_10
#define LED_S_FIRST_GPIO_Port GPIOA
#define BTN_EAST_Pin GPIO_PIN_8
#define BTN_EAST_GPIO_Port GPIOC
#define LED_N_FIRST_Pin GPIO_PIN_3
#define LED_N_FIRST_GPIO_Port GPIOB
#define LED_N_SECOND_Pin GPIO_PIN_4
#define LED_N_SECOND_GPIO_Port GPIOB
#define LED_E_RED_Pin GPIO_PIN_5
#define LED_E_RED_GPIO_Port GPIOB
#define LED_E_YELLOW_Pin GPIO_PIN_6
#define LED_E_YELLOW_GPIO_Port GPIOB
#define LED_E_GREEN_Pin GPIO_PIN_7
#define LED_E_GREEN_GPIO_Port GPIOB
#define LED_E_FIRST_Pin GPIO_PIN_8
#define LED_E_FIRST_GPIO_Port GPIOB
#define LED_E_SECOND_Pin GPIO_PIN_9
#define LED_E_SECOND_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
